# X
xorg-server
xorg-xinit
xorg-xrdb
xorg-xsetroot
xorg-xset
xorg-xwininfo
xorg-xprop
arandr
# desktop common
alsa-utils
# terminal
kitty
# program launcherq
rofi
# gui text editor
geany
# status bar
polybar
# wallpaper setter
feh
# xfce4-settings # replaced with nwg-look
# filemanager
thunar
thunar-volman
thunar-archive-plugin
# usb automounter
udiskie
xarchiver
zip
unzip
zsh
lua
thefuck
# screenshot app
maim
htop
yad
xdotool
libnotify
lm_sensors
slock
plocate
pacman-contrib
# theming
adw-gtk-theme
libertinus-font
ttf-jetbrains-mono
noto-fonts
noto-fonts-emoji
papirus-icon-theme
# gui apps
meld
ghex
gnome-calculator
# system essentials
polkit-gnome
gnome-keyring
# window manager
#bspwm sxhkd
i3
# Misc apps
zathura
zathura-pdf-mupdf
# other command line tools
mpv
dunst
mpd
mpc
ncmpcpp
#
nwg-look
#bc highlight fzf mediainfo poppler yt-dlp ffmpeg
#atool imagemagick python-pillow ffmpegthumbnailer ranger
#speedtest-cli
